-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: library
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `app_user`
--

LOCK TABLES `app_user` WRITE;
/*!40000 ALTER TABLE `app_user` DISABLE KEYS */;
INSERT INTO `app_user` VALUES (1,'Марія','Коц','kocmaria943@gmail.com','380 50 123 4567','$2a$10$b.DR4CFllWZ0HVBpAsxbrOjZHthHPtHPDhJhe8lfGt8t3yzZeyZ0G',2),(2,'Дмитро','Петрів','email2@gmail.com','380 67 987 6543','12345',1),(3,'Ольга','Коваленко','email3@gmail.com','380 93 111 2233','admin',2),(4,'Марія','Савченко','email4@gmail.com','380 93 598 2643','4273',1),(5,'Олександр','Мельник','email5@gmail.com','380 67 598 2843','73652',1),(6,'Наталія','Бондаренко','email6@gmail.com','380 67 398 7843','732488',1),(7,'Сергій','Шевченко','email7@gmail.com','380 50 378 7243','атткт247',1),(8,'Олена','Лисенко','email8@gmail.com','380 50 348 4863','5275оегоег',1),(9,'Дмитро','Петренко','email9@gmail.com','380 67 298 4843','12345',2),(10,'Вікторія','Кравченко','email10@gmail.com','380 67 298 4893','\\75373поео',2),(11,'Михайло','Кравченко','email11@gmail.com','380 67 888 4893','12345',1),(12,'Алексій','Пономаренко','email12@gmail.com','380 50 878 6693','75277пл',1),(13,'Марина','Коц','email13@gmail.com','380 67 898 4773','88837поьпо',1),(14,'Ірина','Ткаченко','email78@gmail.com','+380 (99) 337 26 77','12345',1),(18,'Hacker','Admin','hacker@test.com','777','hacked',2),(19,'ZAP','ZAP','zaproxy@example.com','9999999999','ZAP',1),(20,'Новий','Читач','client@test.com','380991112233','$2a$10$DbClLhw0.ARj.38F8D1XFue8m/Iiyie9B4F1cM3O2ZCsQ345M2GAy',1),(21,'Головний','Адмін','admin@test.com','380995556677','$2a$10$b.DR4CFllWZ0HVBpAsxbrOjZHthHPtHPDhJhe8lfGt8t3yzZeyZ0G',2);
/*!40000 ALTER TABLE `app_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book`
--

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;
INSERT INTO `book` VALUES (1,'1984','Джордж Орвелл','Англійська',328,2,1,'Знаменита антиутопія про тоталітарне суспільство, де панує Великий Брат, а будь-яка свобода думки карається. Це кривава драма про людину, яка намагається зберегти залишки свідомості в умовах жорсткого психологічного та фізичного контролю, де історію переписують щодня.',5,2),(2,'Майстер і Маргарита','Михайло Булгаков','Російська',480,1,1,'Містичний роман про несподіваний візит диявола до радянської Москви та історію справжнього кохання, що долає час, простір і смерть. Це складна багаторівнева історія, де переплітаються доля Понтія Пілата, розчарованого Майстра та відданої Маргарити.',0,0),(3,'За двома зайцями','Михайло Старицький','Українська',200,1,1,'Сатирична комедія про невдалого свата Голохвастова, який намагався всидіти на двох стільцях, але залишився ні з чим. Книга яскраво висміює лицемірство, міщанство та прагнення видати себе за когось іншого.',0,0),(4,'Гаррі Поттер і філософський камінь','Джоан Роулінг','Англійська',223,1,1,'Перша книга про хлопчика, який вижив, та його навчання у школі чарів та чаклунства Гоґвортс. Це світ, де магія стає не просто можливістю, а справжнім випробуванням на мужність, дружбу та відданість у боротьбі зі світовим злом.',10,10),(5,'Гордість і упередження','Джейн Остін','Англійська',432,1,1,'Класичний роман про кохання, соціальні бар’єри та боротьбу із власними упередженнями в Англії 19 століття. Елізабет Беннет повинна пройти шлях через власні помилки та гордість, щоб зрозуміти, що справжнє почуття не підкоряється правилам етикету.',6,4),(6,'Портрет Доріана Грея','Оскар Вайльд','Англійська',254,1,1,'Філософська історія про юнака, чий портрет старіє та відображає гріхи, поки сам Доріан залишається незмінно молодим. Це темна ода естетизму, де за ідеальною зовнішністю ховається моральна гниль.',4,0),(7,'Три товариші','Еріх Марія Ремарк','Німецька',416,1,1,'Пронизлива історія про дружбу, любов та виживання в умовах післявоєнної Німеччини. Це роман про людей, які втратили все, крім людяності, і знаходять розраду в міцній чоловічій дружбі та коротких хвилинах щастя.',5,2),(8,'Аліса в Країні Чудес','Льюїс Керролл','Англійська',128,1,1,'Сюрреалістична подорож маленької дівчинки Аліси у дивовижний світ, де діють зовсім інші закони логіки. Книга сповнена філософських загадок, математичних парадоксів та гри слів, що кидають виклик звичному баченню реальності.',8,5),(9,'Запах думки','Роберт Шеклі','Англійська',224,1,1,'Наукова фантастика про виживання на чужій планеті, де навколишній світ реагує на думки головного героя. Коли телепатія стає небезпечною, єдиний шанс — навчитися контролювати власні страхи та мрії.',0,1),(10,'Тигролови','Іван Багряний','Українська',288,1,1,'Пригодницький роман про втечу радянського в’язня з поїзда смерті та його боротьбу за волю у сибірській тайзі. Це ода людській силі духу, яка виявляється міцнішою за найжорстокішу тиранію.',4,2),(11,'Сторонній','Альбер Камю','Французька',192,1,1,'Філософський роман про людину, яка відмовляється жити за нав’язаними суспільством правилами та сприймає світ без емоцій. Мерсо — людина, яка не намагається здаватися кращою, ніж вона є, що зрештою призводить до трагедії.',3,3),(12,'Кобзар','Тарас Шевченко','Українська',240,1,1,'Фундаментальна збірка поезій Тараса Шевченка, що стала душею української літератури та боротьби за волю. Це книга, яка формувала національну свідомість поколінь.',12,12),(13,'Дюна','Френк Герберт','Англійська',544,1,1,'Епічна науково-фантастична сага про боротьбу за пустельну планету Арракіс та найцінніший ресурс у всесвіті — прянощі, що дарують дар передбачення.',7,7),(14,'Маленький принц','Антуан де Сент-Екзюпері','Французька',96,1,1,'Мудра та ніжна казка про відповідальність, кохання та справжні людські цінності, які ми часто забуваємо, стаючи дорослими. Книга нагадує, що найголовніше — те, чого не побачиш очима.',9,0),(15,'Пригоди Тома Сойєра','Марк Твен','Англійська',224,1,1,'Веселі пригоди хлопчиків на березі річки Міссісіпі, наповнені дитячими витівками, щирою дружбою, першим коханням та відкриттям того, що означає бути дорослим.',5,5),(16,'Нічний цирк','Ерін Морґенштерн','Англійська',387,1,1,'Магічна історія про таємничий цирк, який з’являється лише вночі та зникає з першими променями сонця. Це арена для гри двох магів, де ціною програшу є власне життя.',0,0),(17,'Ловець у житі','Джером Селінджер','Англійська',277,1,1,'Книга про складний внутрішній світ підлітка, що гостро відчуває фальш навколишнього світу та прагне захистити чистоту дитинства від впливу жорстокого дорослішання.',4,1),(18,'Фауст','Йоганн В. Гете','Німецька',464,1,1,'Велична трагедія про вченого, який продав душу дияволу заради абсолютного знання та мирських насолод. Це історія про ціну досвіду та вічну боротьбу між світлом і темрявою всередині кожного з нас.',3,2),(19,'Дванадцять стільців','Ільф і Петров','Російська',384,1,1,'Сатиричний роман про неймовірні пригоди Остапа Бендера у пошуках діамантів, захованих у стільці. Гротескний світ, де жадібність зустрічається з геніальною винахідливістю.',6,3),(20,'Пісня льоду й полум’я','Джордж Мартін','Англійська',694,1,1,'Масштабне фентезі про запеклу боротьбу за владу у королівстві Вестерос, де кожна інтрига може коштувати життя, а зима, що триває роками, готує найстрашніше випробування.',5,1),(21,'Книга для видалення','Тестовий Автор','Українська',123,3,1,'Ця книга буде видалена',1,0);
/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_status`
--

LOCK TABLES `book_status` WRITE;
/*!40000 ALTER TABLE `book_status` DISABLE KEYS */;
INSERT INTO `book_status` VALUES (1,'В наявності','книга наявна в бібліотеці'),(2,'Немає в наявності','книгу вже хтось взяв'),(3,'Вилучено','Книгу назавжди вилучено з фонду бібліотеки');
/*!40000 ALTER TABLE `book_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `cart_book`
--

LOCK TABLES `cart_book` WRITE;
/*!40000 ALTER TABLE `cart_book` DISABLE KEYS */;
/*!40000 ALTER TABLE `cart_book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `genre`
--

LOCK TABLES `genre` WRITE;
/*!40000 ALTER TABLE `genre` DISABLE KEYS */;
INSERT INTO `genre` VALUES (1,'Антиутопія'),(2,'Роман'),(3,'Комедія'),(4,'Фентезі'),(5,'Поезія'),(6,'Філософський роман'),(7,'Казка'),(8,'Наукова фантастика'),(9,'Пригодницький роман'),(10,'Притча');
/*!40000 ALTER TABLE `genre` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reservation`
--

LOCK TABLES `reservation` WRITE;
/*!40000 ALTER TABLE `reservation` DISABLE KEYS */;
INSERT INTO `reservation` VALUES (1,1,1,NULL,'2025-06-09','2025-06-12','2025-06-19'),(2,1,5,NULL,'2025-02-05','2025-02-07','2025-06-19'),(3,2,3,NULL,'2025-06-08','2025-06-08','2025-06-08'),(4,4,4,NULL,'2025-06-07','2025-06-08','2026-06-13'),(5,7,4,NULL,'2025-04-24','2025-04-24','2026-06-13'),(6,5,2,NULL,'2025-05-10','2025-05-11','2025-05-12'),(7,5,1,NULL,'2025-06-01','2025-06-05','2025-06-19'),(8,6,4,NULL,'2025-06-02','2025-06-03','2026-06-13'),(9,4,5,NULL,'2025-04-01','2025-04-02','2025-05-01'),(10,2,4,NULL,'2025-03-10','2025-03-12','2025-04-15'),(11,1,4,NULL,'2025-06-05','2025-06-06','2026-06-13'),(12,11,2,NULL,'2025-06-12','2025-06-13','2025-06-19'),(13,8,2,NULL,'2025-05-05','2025-05-07','2025-05-07'),(14,12,5,NULL,'2025-02-01','2025-02-05','2025-03-01'),(15,13,4,NULL,'2025-06-10','2025-06-11','2026-06-13'),(16,14,3,NULL,'2025-06-19','2025-06-21','2025-06-19'),(17,1,1,NULL,'2026-05-13','2026-05-14','2026-05-13'),(18,20,4,NULL,'2026-06-13','2026-06-13','2026-06-13');
/*!40000 ALTER TABLE `reservation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reservation_book`
--

LOCK TABLES `reservation_book` WRITE;
/*!40000 ALTER TABLE `reservation_book` DISABLE KEYS */;
INSERT INTO `reservation_book` VALUES (1,1,NULL,NULL,'2025-07-12',3,0,0),(1,18,NULL,NULL,'2026-06-12',4,0,1),(2,3,NULL,NULL,'2025-07-08',3,0,0),(2,16,NULL,NULL,'2025-07-19',3,0,0),(3,2,NULL,NULL,'2025-03-07',4,0,1),(3,10,NULL,NULL,'2025-04-12',2,0,0),(5,6,NULL,NULL,'2025-06-11',5,0,0),(6,9,NULL,NULL,'2025-05-02',4,0,1),(6,17,NULL,NULL,'2026-06-14',1,1,0),(7,4,NULL,NULL,'2025-07-08',4,0,1),(8,5,NULL,NULL,'2025-05-25',4,0,1),(9,4,NULL,NULL,'2025-07-08',4,0,1),(10,5,NULL,NULL,'2025-05-25',4,0,1),(13,7,NULL,NULL,'2025-07-01',3,0,0),(14,8,NULL,NULL,'2025-07-03',4,0,1),(15,11,NULL,NULL,'2025-07-06',4,0,1),(16,12,NULL,NULL,'2025-07-13',5,0,0),(17,13,NULL,NULL,'2025-06-07',5,0,0),(18,14,NULL,NULL,'2025-03-01',4,0,1),(19,15,NULL,NULL,'2025-07-11',4,0,1);
/*!40000 ALTER TABLE `reservation_book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reservation_book_status`
--

LOCK TABLES `reservation_book_status` WRITE;
/*!40000 ALTER TABLE `reservation_book_status` DISABLE KEYS */;
INSERT INTO `reservation_book_status` VALUES (1,'Отримано','клієнт отримав книгу'),(2,'Прострочено','клієнт не повернув книгу до вказаного строку'),(3,'Очікування','заказ очикує на обробку'),(4,'Повернуто','клієнт повернув книгу до бібліотеки'),(5,'Відхилено','заказ і книги в заказі відхилено');
/*!40000 ALTER TABLE `reservation_book_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reservation_status`
--

LOCK TABLES `reservation_status` WRITE;
/*!40000 ALTER TABLE `reservation_status` DISABLE KEYS */;
INSERT INTO `reservation_status` VALUES (1,'Підтверджено','заказ прийнято'),(2,'Відхилено','заказ відхилено'),(3,'Очікування','заказ очикує на обробку'),(4,'Прострочено','заказ прострочено'),(5,'Закрито','заказ виповнен і закрит');
/*!40000 ALTER TABLE `reservation_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `shopping_cart`
--

LOCK TABLES `shopping_cart` WRITE;
/*!40000 ALTER TABLE `shopping_cart` DISABLE KEYS */;
INSERT INTO `shopping_cart` VALUES (1,1),(2,2),(3,3),(4,4),(5,5),(6,6),(7,7),(8,8),(9,9),(10,10),(11,14),(12,19),(13,20);
/*!40000 ALTER TABLE `shopping_cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `user_role`
--

LOCK TABLES `user_role` WRITE;
/*!40000 ALTER TABLE `user_role` DISABLE KEYS */;
INSERT INTO `user_role` VALUES (1,'client','client of the library'),(2,'admin','admin of the library');
/*!40000 ALTER TABLE `user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-13 20:54:55
